<?php
/**
 * Created by PhpStorm.
 * User: CleverCloud
 * Date: 2020/11/11
 * Time: 16:47
 * 上一期我们讲到也速该救下诃额伦
 * 在举行婚礼的当天
 * 遭到了塔塔儿人和蔑儿乞人的袭击
 * 由于没有任何防备，乞颜部死伤很严重
 * 公元1162年，乞颜部恢复了元气
 * 也速该决定向塔塔儿人讨回血债
 * 双方都出动了能够动用的力量
 * 经过一番激战后
 * 乞颜部取得了胜利
 * 还活捉了塔塔儿的首领铁木真兀格
 * 塔塔儿残余部落只能迁移
 * 当也速该率队回到营地
 * 诃额伦也生了个手握凝血的儿子
 * 也速该决定以塔塔儿首领的名字
 * 作为自己儿子的名字
 * 于是让脱朵杀了铁木真兀格
 *
 * 转眼间铁木真已经9岁了
 * 有次和也速该去狩猎
 * 碰到了一个有趣的小孩子
 * 原来他就是札达兰部的札木合
 * 他们两个争执猎物是谁先射到的
 * 最后决定通过摔跤决胜负，胜者得到猎物
 * 一顿三局两胜制过后，铁木真胜了
 * 铁木真也觉得札木合值得交往
 * 决定和他结为安达
 * 这就是铁木真和札木合一结安达
 *
 * 也速该和诃额伦商量决定给铁木真定亲
 * 预知后面定亲
 *
 *
 * 1171年，铁木真离开母亲
 * 跟着也速该去遥远的弘吉剌部定亲
 * 诃额伦提醒多带些人去
 * 毕竟要经过塔塔儿人的营地
 * 但是也速该却说去定亲，又不是打仗
 * 用不着多带人，只带着脱朵一个随从
 *
 * 这也恰恰被部落里的小人利用
 * 塔里忽台派人把也速该的消息传给塔塔尔的首领
 * 塔塔尔首领商量该如何对付也速该
 * 当他们商议要聚集所有人马时
 * 一个13岁的小孩却说有了计划
 * 这个小孩就是铁木真兀格的儿子扎邻不合
 *12
 * 这边也速该经过几天，也顺利到达弘吉剌部
 * 他们有些迷路了，他们看到远处有一个采花的小女孩
 * 于是前去问路，小女孩告诉他们这就是弘吉剌部
 * 这时小女孩父亲也来了
 * 也速该和他对视了几秒，都亲切了起来
 * 原来他就是德薛禅
 * 小女孩是他的女儿孛儿帖
 * 一阵寒暄之后，来到德薛禅家
 * 也速该说明来意之后
 * 德薛禅说昨晚梦到海东青带着太阳和月亮落到他手掌上
 * 也速该一听，就询问孛儿帖几岁了
 * 正好孛儿帖10岁，铁木真9岁
 * 双方也达成共识，就定下了这门亲事
 * 按照草原上的定亲规矩，铁木真要留在孛儿帖家
 * 也速该带着脱朵离开弘吉剌部
 *27
 * 在经过一片树林的时候，看到有炊烟
 * 按照草原上的习俗，路过的客人必须下马入席
 * 脱朵提醒这里离塔塔儿营地很近
 * 但是也速该却没有任何防备之心
 * 要按照草原习俗入席就座
 * 一番热情问候之后
 * 扎邻不合端上了有毒的马奶酒
 * 还唱起了祝酒歌
 * 也速该在这热情的气氛中喝下了酒
 * 待也速该喝下毒酒后，塔塔儿人也露出了狐狸尾巴
 * 坦白了他们的阴谋，让也速该回去等死吧
 * 也速该也气愤，说战场上的事不应该在战场解决
 * 而不应该卑鄙到运用草原习俗加以毒害
 * 但是一切都晚了，也速该指责扎邻不合这么小就如此歹毒
 * 终有一天我后人替我报仇的时候
 * 要杀光超过车轮高的塔塔儿人
 *43
 * 预知后事如何，请听下回分解
 * 大家好，我是壹圈圈
 * 下期我会讲到也速该殒命，乞颜部离散
 * 46
 *
 * 上一期我们讲到幹儿伯离散乞颜部落
 * 各部落贵族纷纷迁移
 * 刚开始有忠于也速该的部众没有离开
 * 但是塔里忽台动用武力，恐吓逼他们离开
 * 脱朵甚至直接投奔到塔里忽台账下
 * 蒙力克的父亲劝脱朵留下来
 * 还被脱朵直接杀害
 * 诃额伦一家显得非常困难无助
 * 从部落首领的位置掉到生活无保障的地步
 * 铁木真12岁，跟他们的蒙力克一家也选择离开
 * 蒙力克有家室，由于他帮助诃额伦一家
 * 自家的牛羊财物也被驱散殆尽
 * 铁木真希望蒙力克留下来
 * 诃额伦选择让蒙力克离开，毕竟他已经帮助了铁木真一家很多了
 * 随着蒙力克一家的离去，诃额伦一家就剩下3个女人和7个孩子
 * 诃额伦让大家坐在一起商量以后该怎么办
 * 铁木真最年长，诃额伦先让他说
 * 铁木真显得特别坚强懂事
 * 说以后要振兴蒙古乞颜部，要为父亲报仇
 * 诃额伦觉得铁木真长大了，说以后铁木真就是大家的首领
 * 我们都要听从铁木真的命令
 * 一天诃额伦生病了，卧病在床
 * 铁木真看望诃额伦之后，觉得要为母亲补身子
 * 就召集几兄弟商量，决定去抓鱼给母亲吃
 * 就在他们抓鱼的的时候，札木合来看铁木真
 * 铁木真很高兴，这碰巧被别克帖儿和别勒古台看到
 * 别克帖儿开始讽刺札木合，说札达兰人是外族血统
 * 也不配和孛儿只斤家族的人结为安达
 * 铁木真很生气，制止了他们
 * 他拉着札木合再次结安达
 * 这边别克帖儿又抢了铁木真他们摸的鱼
 * 还摔倒了哈萨尔，吓哭了帖木仑
 * 待他们逃跑后，札木合说他两是豺狼
 * 早晚会成为祸害，铁木真一听觉得有道理
 * 就和哈萨尔回去拿弓箭，准备杀掉他两
 * 豁阿黑臣起疑，问帖木格铁木真干啥去
 * 帖木格说出了实情，豁阿黑臣赶紧告诉了诃额伦
 * 别克帖儿和别勒古台在树林里烤鱼
 * 殊不知他两将大祸临头
 * 铁木真和哈萨尔包过去围住了他们
 * 放过别勒古台，别克帖儿被留下来
 * 铁木真细数别克帖儿的罪名之后
 * 别克帖儿表示不服，要求公平对射
 * 铁木真大气，让别克帖儿先射
 * 但是别克帖儿箭法不精，没有射中
 * 轮到铁木真，他直接射中了别克帖儿的要害
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 */
function discriptionBase($a,$b){

    return $a+$b;
}

echo discriptionBase(5,9);
